[
  {
    "name": "Álgebra Lineal",
    "prerequisite": "Precálculo",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "rodriguez-c",
        "name": "César Rodríguez",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Excelente profesor y hermosa materia. Recomendado César totalmente para todas las clases que dicta. Es formal (da definiciones, teoremas con sus demostraciones, etc.), habla sobre las aplicaciones de los conceptos, y enseña muy bien la parte mecánica, que al final es lo que se evalúa. Sobre eso, califica muy generosamente. No penaliza mucho errores de cálculos simples, que son fáciles de cometer en esta materia si no dejan usar calculadora (que fue mi caso), y en cambio, si premia mucho que uno entienda los conceptos. El único defecto que tiene, y es uno grande, es que es súper difícil acceder a él afuera de la clase. Dice que no le funciona el correo (no sé como es posible eso), nunca contesta por e-aulas, entonces toca depender del monitor para todo contacto con él. Sin embargo, es tan bueno como docente que lo compensa.",
            "rating": 4.5,
            "date": "2025-06-08",
            "course": "Álgebra Lineal"
          }
        ]
      },
      {
        "slug": "martinez-j",
        "name": "Juan Carlos Martínez",
        "rating": 0.5,
        "reviews": [
          {
            "text": "El curso puede ser bastante abstracto y no ser muy útil para cursos posteriores. Los temas útiles corresponden a entender una matriz, sacar determinantes y regresión lineal. Pone a prueba las habilidades matemáticas.",
            "rating": 0.5,
            "date": "2025-06-08",
            "course": "Álgebra Lineal"
          }
        ]
      },
      {
        "slug": "muete-w",
        "name": "Walther Muete",
        "rating": 2.83,
        "reviews": [
          {
            "text": "Excelente profesor, le gusta tener buena relación con sus estudiantes, haciendo que la materia sea mucho más llevadera. Explica con claridad, no tiene problema en responder preguntas o devolverse si hay dudas.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Álgebra Lineal"
          },
          {
            "text": "Curso de alta dificultad, en el que por la naturaleza de la materia en si, los parciales pueden ser largos y propensos a errores. Recomiendo poner atención desde el primer momento de la primera clase, y practicar constantemente",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Álgebra Lineal"
          },
          {
            "text": "Es muy buena persona, pero como profesor no explica bien, manda tareas por medio de canales no institucionales como WhatsApp, a veces no explica algunos temas y se demora mucho explicando otros poco importantes, además es pasivo agresivo muchas veces con algunas personas en especifico",
            "rating": 1.5,
            "date": "2025-06-11",
            "course": "Álgebra Lineal"
          }
        ]
      },
      {
        "slug": "sarmiento-n",
        "name": "Norma Sarmiento",
        "rating": 5,
        "reviews": [
          {
            "text": "La profesora explica muy bien, los parciales van acorde a lo visto y la carga académica es baja.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Álgebra Lineal"
          },
          {
            "text": "La profesora no solo conoce en profundidad los contenidos de la clase, sino que además, utiliza estrategias pedagógicas que benefician mucho el aprendizaje. Adicional, la profesora valora y reconoce el esfuerzo de los estudiantes.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Álgebra Lineal"
          }
        ]
      },
      {
        "slug": "castro-d",
        "name": "Daniel Castro",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Me gustó mucho el curso con Daniel, fue muy fácil y se aprende todo lo necesario de buena manera.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Álgebra Lineal"
          },
          {
            "text": "El curso no es complicado, el profesor va a enseñar y es poco exigente",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Álgebra Lineal"
          }
        ]
      }
    ]
  },
  {
    "name": "Algoritmos y Estructuras de Datos",
    "prerequisite": "Programación de Computadores",
    "difficulty": 4,
    "professors": [
      {
        "slug": "wightman-p",
        "name": "Pedro Wightman",
        "rating": 4,
        "reviews": [
          {
            "text": "Es muy importante tener buenas bases en C++. Con eso, la clase es bastante sencilla. El profesor Pedro tiene una metodología muy práctica, con muchos ejercicios en clase, no tanta teoría. Los parciales son muy sencillos si uno hace los ejercicios. También, con el proyecto, que pesa el 25%, fácilmente se puede subir mucho la nota si a uno no le fue tan bien en algún parcial. Recomiendo 100% verla con él.",
            "rating": 4.5,
            "date": "2025-06-08",
            "course": "Algoritmos y Estructuras de Datos"
          },
          {
            "text": "La clase puede ser o muy fácil o extremadamente difícil, todo depende de las bases que uno tenga en programación. Clave dominar o por lo menos entender programación orientada a objetos en C++, porque todos los temas de la clase se basan en eso y el profesor asume que uno ya sabe, y no explica para nada lo que se supone que uno aprendió en programación. En lo personal mi experiencia fue buena, nunca me costó pasar un parcial e igual con el proyecto se levanta bastante la nota, pero si tuve gente en mi grupo que la sufrió un resto. Pedro es muy bueno, sabe muchísimo, pero solamente van a aprovechar eso los que tengan buenas bases... si no, creo que la experiencia es pésima, vas a sentir que el man va a toda, que no explica nada y que los parciales son imposibles. Todo depende de lo que uno ya sepa...",
            "rating": 3.5,
            "date": "2025-06-08",
            "course": "Algoritmos y Estructuras de Datos"
          }
        ]
      },
      {
        "slug": "garcia-ls",
        "name": "Luz Stella García",
        "rating": 1,
        "reviews": [
          {
            "text": "No la recomiendo para nada. Hace la clase mucho más difícil que el otro profesor, califica super raro, los parciales son muy teóricos.. metanla con Pedro.",
            "rating": 1,
            "date": "2025-06-08",
            "course": "Algoritmos y Estructuras de Datos"
          }
        ]
      }
    ]
  },
  {
    "name": "Cálculo I",
    "prerequisite": "Precálculo",
    "difficulty": 3.75,
    "professors": [
      {
        "slug": "muete-w",
        "name": "Walther Muete",
        "rating": 4.27,
        "reviews": [
          {
            "text": "Es demasiado importante para el resto de la carrera. En lo personal sugiero un montón verla con Walther porque es bastante exigente y te deja muy bien preparado para los cursos siguientes: Microeconomía I y Cálculo II. Esto hace que uno se esfuerce más al momento de verla, pero el semestre siguiente es más suave. Califica bastante rápido y es muy accesible si uno tiene dudas que necesitan ser resueltas. La clase es dinámica y muy amena. Posible desventaja es que tiene el Excel de notas público para todos.",
            "rating": 4.5,
            "date": "2025-06-08",
            "course": "Cálculo I"
          },
          {
            "text": "El curso esta bien, sin embargo el profesor lo hace un poco complicado, aveces va muy rápido, no es claro en algunas cosas, el parcial es mucho mas dificil de las explicaciones de la clase y la forma de calificar es muyy estricta",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Cálculo I"
          },
          {
            "text": "Si bien es un profesor bastante estricto, con él que “sí o sí” vas a aprender y vas a obtener excelentes bases para la carrera. Es un profesor que no solo es matemático, sino que tiene conocimientos económicos, lo cual permite que las clases sean más aplicadas, algo fundamental en cálculo diferencial.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Cálculo I"
          },
          {
            "text": "Con Walther es un poco más difícil pero se aprende más y este curso es fundamental para el resto de la carrera, entonces recomendado Walther.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Cálculo I"
          },
          {
            "text": "El curso requiere mucha práctica, pero no es inherentemente difícil. Walther califica duro, pero explica bien, así que hay que aprovechar sus clases y practicar constantemente. Vi la materia cuando no había monitoria regular, así que eso también influyó en el rendimiento. La \"tutoría\" con el profesor no sirve de mucho, pues solo es hacer unos qüizes.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Cálculo I"
          },
          {
            "text": "La materia puede ser complicada, pero el profe Walther la hace muy buena y agradable. Incentiva mucho el aprendizaje de los estudiantes.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Cálculo I"
          },
          {
            "text": "A pesar de ser un curso un poco complicado, Walther es muy buen profesor, es un poco exigente al calificar los parciales pero uno aprende mucho",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Cálculo I"
          },
          {
            "text": "El profesor es exigente porque explica muy bien, él sabe que lo que él enseña es muy acorde a lo que evalúa, me funcionó mucho para microeconomía tener una buena base de cálculo diferencial",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Cálculo I"
          },
          {
            "text": "Calculo I es super importante para el resto de la carrera y aunque en principio no es fácil, Walther es un excelente profesor.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Cálculo I"
          }
        ]
      },
      {
        "slug": "casas-d",
        "name": "Diego Casas",
        "rating": 4,
        "reviews": [
          {
            "text": "Muy buen profesor, explica todo al detalle y intenta hacer ejercicios en clase que se van a parecer a los del parcial, lo malo es que a veces llega a ser pasivo agresivo y además llega bastante tarde a clase",
            "rating": 4,
            "date": "2025-06-11",
            "course": "Cálculo I"
          }
        ]
      }
    ]
  },
  {
    "name": "Cálculo II",
    "prerequisite": "Cálculo I",
    "difficulty": 2.55,
    "professors": [
      {
        "slug": "sarmiento-n",
        "name": "Norma Sarmiento",
        "rating": 4.37,
        "reviews": [
          {
            "text": "Es una asignatura relativamente sencilla que con pocas horas de estudio se puede pasar sin dificultades. No es tan útil todo el curso, pero puede ayudar a subir el promedio semestral. Norma es excelente profesora, muy ordenada y entrega notas bastante rápido.",
            "rating": 4,
            "date": "2025-06-08",
            "course": "Cálculo II"
          },
          {
            "text": "Super buena profesora explica excelente",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Cálculo II"
          },
          {
            "text": "Es un curso el cual no se requiere mucho esfuerzo y la profesora explica muy bien",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Cálculo II"
          },
          {
            "text": "La profesora cuenta con los conocimientos requeridos para dictar el curso y aplica metodologías pedagógicas fundamentales para el aprendizaje. Adicional, muestra gran pasión por la materia que motivan el aprendizaje. Por último, se interesa por reconocer el esfuerzo de los estudiantes.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Cálculo II"
          },
          {
            "text": "Curso de baja dificultad en el que con practicar se dominan los temas. Norma explica bien y es muy factible dejar el curso alto.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Cálculo II"
          },
          {
            "text": "Norma es la mejor profesora para la materia de Cálculo II, es bastante querida y está muy pendiente de los estudiantes. La materia no es super difícil pero es de bastante práctica.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Cálculo II"
          },
          {
            "text": "Norma es muy escuelera (tema, ejemplos, ejercicios y taller) personalmente creo que es una de las mejores formas de enseñar y me encanta... Es sencillo entenderle y es muy amable (eso no significa que deje de ser estricta o que regale puntos extra así como así) hay que estudiar muy bien y el proyecto (cuando lo vi) dejo tema libre.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Cálculo II"
          },
          {
            "text": "Es súper querida y da muchos ejemplos. Se entiende fácil",
            "rating": 4.5,
            "date": "2025-06-20",
            "course": "Cálculo II"
          }
        ]
      },
      {
        "slug": "castro-d",
        "name": "Daniel Castro",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Me gustó mucho la forma de explicar los temas, se realizaron muchos ejemplos y fue muy didáctica la clase, muy fácil de entender los temas ya que va a un buen ritmo.",
            "rating": 4.5,
            "date": "2025-06-20",
            "course": "Cálculo II"
          },
          {
            "text": "Excelente clase me encantó enserio la manera como se dió y realmente muy práctica la materia, el profe Daniel maneja muy bien cada tema y cada truco que da en cada ejercicio facilita la comprensión",
            "rating": 5,
            "date": "2025-06-20",
            "course": "Cálculo II"
          },
          {
            "text": "Él es un excelente profe, con bastante conocimiento y una metodología muy práctica para pocos estudiantes. Cosas a mejorar: de pronto el dinamismo de las clases y distribución de tiempos.",
            "rating": 4,
            "date": "2025-06-20",
            "course": "Cálculo II"
          }
        ]
      }
    ]
  },
  {
    "name": "Constitución Política e Instrucción Cívica",
    "prerequisite": "N/A",
    "difficulty": 2,
    "professors": [
      {
        "slug": "valencia-d",
        "name": "Diana Valencia",
        "rating": 4,
        "reviews": [
          {
            "text": "Es un curso útil para entender a grandes rasgos cómo funciona el estado y la historia de la constitución. Con la profesora Diana se aprende lo necesario, hace el curso simplificado para los economistas y las evaluaciones son bastante sencillas. Excelente ser humano.",
            "rating": 5,
            "date": "2025-06-08",
            "course": "Constitución Política e Instrucción Cívica"
          },
          {
            "text": "La profesora es exigente con la materia, siendo profesora de derecho pero no es complicada pasarla. Realizar las actividades en clase y hacer las lecturas pertinentes.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Constitución Política e Instrucción Cívica"
          }
        ]
      }
    ]
  },
  {
    "name": "Contabilidad Financiera",
    "prerequisite": "N/A",
    "difficulty": 1,
    "professors": [
      {
        "slug": "castelblanco-o",
        "name": "Omar Castelblanco",
        "rating": 4.5,
        "reviews": [
          {
            "text": "La clase es muy útil para entender la estructura de las empresas, interpretar cifras y pensar como empresarios. Este profesor hacía la clase muy sencilla, evaluaciones retadoras y fácil de aprobarla.",
            "rating": 4.5,
            "date": "2025-06-08",
            "course": "Contabilidad Financiera"
          }
        ]
      },
      {
        "slug": "villa-j",
        "name": "Joaquín Villa",
        "rating": 3,
        "reviews": [
          {
            "text": "Contabilidad es una materia bastante interesante y el profesor se nota que sabe un montón, además, es bastante practico",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Contabilidad Financiera"
          },
          {
            "text": "Es un profesor que no sabe explicar muy bien, solo lee diapositivas y al hacerle preguntas de ciertas cosas no sabe responderlas, sin embargo la materia es fácil",
            "rating": 1.5,
            "date": "2025-06-19",
            "course": "Contabilidad Financiera"
          }
        ]
      }
    ]
  },
  {
    "name": "Curso Básico R",
    "prerequisite": "Econometría Básica",
    "difficulty": 1,
    "professors": [
      {
        "slug": "marin-m",
        "name": "Margarita Marín",
        "rating": 0.5,
        "reviews": [
          {
            "text": "La profesora no explicaba y faltaba mucho a clase avisando con poco tiempo de antelación",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Curso Básico R"
          }
        ]
      }
    ]
  },
  {
    "name": "Curso Básico STATA",
    "prerequisite": "Econometría Básica",
    "difficulty": 3.66,
    "professors": [
      {
        "slug": "lopez-n",
        "name": "Nazly López",
        "rating": 3.33,
        "reviews": [
          {
            "text": "Fue un curso muy útil para entender este software estadística y reforzar temas de Econometría Básica de manera más práctica. La profesora Nazly hace muy fácil aprender y entender las funciones de STATA. También, trae bases de datos muy útiles. Recomendadísimo el curso.",
            "rating": 5,
            "date": "2025-06-08",
            "course": "Curso Básico STATA"
          },
          {
            "text": "Bastante práctico, se aprende bastante y la profesora explica detalladamente la aplicación de cada uno de los temas",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Curso Básico STATA"
          },
          {
            "text": "Mul mala experiencia. Una profesora que no sabe enseñar, va demasiado rápido en la clases, no le gusta que se le pregunté y no da la argumentación de porque de las notas.",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Curso Básico STATA"
          }
        ]
      }
    ]
  },
  {
    "name": "Derivados",
    "prerequisite": "Economía Financiera, Renta Fija",
    "difficulty": 3,
    "professors": [
      {
        "slug": "ramirez-g",
        "name": "Gonzalo Ramírez",
        "rating": 4,
        "reviews": [
          {
            "text": "Excelente profesor. Manejo perfecto de los temas del curso, notable el conocimiento sobre este, ejemplos útiles de la vida real y ejercicios prácticos relevantes para entender. Las evaluaciones son parciales de opción múltiple bastante sencillos. En lo personal, la línea de finanzas no es de mi agrado y estos temas se me hacían pesados, pero a quien le guste le encantará.",
            "rating": 4,
            "date": "2025-06-08",
            "course": "Derivados"
          }
        ]
      }
    ]
  },
  {
    "name": "Desarrollo Económico",
    "prerequisite": "Introducción a la Ciencia Económica y Estadística",
    "difficulty": 3.5,
    "professors": [
      {
        "slug": "seither-j",
        "name": "Julia Seither",
        "rating": 4.25,
        "reviews": [
          {
            "text": "Curso con temáticas interesantes que motivan la participación. Hay que ir todas las clases porque siempre se saca nota. A la hora de estudiar, no confiarse y revisar todos los recursos del curso.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Desarrollo Económico"
          },
          {
            "text": "Una clase muy buena. Combina tanto los componentes teóricos como prácticos de la carrera y permite que se reflexione sobre temas muy importantes de la economía, a través de debates y dinámicas en la clase, donde se discuten temas complicados pero necesarios para tener una mejor visión del desarrollo economico.",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Desarrollo Económico"
          }
        ]
      }
    ]
  },
  {
    "name": "Doctrinas Económicas",
    "prerequisite": "N/A",
    "difficulty": 3.16,
    "professors": [
      {
        "slug": "castrillon-a",
        "name": "Alberto Castrillón",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Un curso para entender sobre el pensamiento económico a lo largo del tiempo, recap de las escuelas económicas y autores relevantes. El profesor Castrillón explica con facilidad los temas, no hace ningún tipo de control de lectura y sus clases son muy interesantes. El día antes del parcial hace un taller que es al menos 75% idéntico al parcial. Una clase para dejarla alta sin dificultades.",
            "rating": 4.5,
            "date": "2025-06-08",
            "course": "Doctrinas Económicas"
          }
        ]
      },
      {
        "slug": "henao-j",
        "name": "José Leonardo Henao",
        "rating": 5,
        "reviews": [
          {
            "text": "Henao es muy buen profesor, los parciales no son difíciles y se aprende mucho",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Doctrinas Económicas"
          }
        ]
      },
      {
        "slug": "bohorquez-j",
        "name": "Jesús Bohórquez",
        "rating": 3.37,
        "reviews": [
          {
            "text": "Muy buen profesor, logra atraparte a través vez  de la historia económica y entender el comportamiento en la actualidad, te incentiva a que no te quedes con las dudas y entiendas de la mejor manera los temas, porque sabe que son parte de la columna vertebral  de la carrera",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Doctrinas Económicas"
          },
          {
            "text": "Jesús es un profesor exigente, y conduce la clase de manera particular. Pero todo lo que hace está conducido a explicar, y las lecturas son perfectas para la clase, siendo clásicos de la economía que se tienen que conocer. Con hacer todas las lecturas basta para dejar la materia bien.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Doctrinas Económicas"
          },
          {
            "text": "El profesor nos comparaba constantemente con otros grupos que había tenido en semestres pasados",
            "rating": 0.5,
            "date": "2025-06-10",
            "course": "Doctrinas Económicas"
          },
          {
            "text": "Cuando la vi en primer semestre no fue muy fácil porque no estaba a costumbrada a leer tanto, pero la clase de Jesús es dinámica y ayuda a comprender a los autores con ejemplos cotidianos. Es importante asistir a las clases y preguntarle, es muy brillante y se interesa por el bienestar de sus estudiantes. Es un poco tosco (algunos dirían que grosero) pero si te acercas a hablarle es bastante agradable y uno de los mejores profesores que he tenido en la carrera. Es un profesional con mucha experiencia en Historia Económica",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Doctrinas Económicas"
          }
        ]
      }
    ]
  },
  {
    "name": "Econometría Básica",
    "prerequisite": "Estadística",
    "difficulty": 3.37,
    "professors": [
      {
        "slug": "rodriguez-p",
        "name": "Paul Rodríguez",
        "rating": 4.6,
        "reviews": [
          {
            "text": "Adoro a Paul como persona, pero me parece muy importante ver el curso con Saavedra, realmente sales mucho mejor preparado.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Econometría Básica"
          },
          {
            "text": "Es un curso que, si bien presenta las bases teóricas a profundidad, se enfoca en las aplicaciones practicas de la econometría, lo que lo hace más valioso para los estudiantes. El profesor Paul explica claro y abre varias actividades para practicar lo aprendido. Julia no se hace entender tan bien, pero también se enfoca en la práctica y en actividades de aplicación",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Econometría Básica"
          },
          {
            "text": "Es un curso muy intuitivo, Paul es un excelente profesor y busca que su clase sea bastante aplicable. Se profundiza en el conocimiento en R y el proyecto es una oportunidad de hacer cosas muy chéveres",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Econometría Básica"
          },
          {
            "text": "Econometría es un curso esencial para el ejercicio profesional del economista. Es importante profundizar en los temas con el material complementario y practicar los códigos para fortalecer las habilidades de programación. El profesor Paul es muy bueno explicando temas complejos y es muy paciente, siempre con una buena disposición a responder dudas.",
            "rating": 5,
            "date": "2025-06-21",
            "course": "Econometría Básica"
          }
        ]
      },
      {
        "slug": "saavedra-s",
        "name": "Santiago Saavedra",
        "rating": 4,
        "reviews": [
          {
            "text": "De los cursos más importantes de la carrera donde se analiza la regresión lineal en su máximo esplendor. Temas de evaluación de impacto son abordados. Este curso reúne lo visto en otros cursos complementando y reforzando los conceptos ya obtenidos. No tuve la mejor experiencia con el profesor Santiago, pero explica bien y eso es lo importante. Los parciales no son complicados.",
            "rating": 1,
            "date": "2025-06-09",
            "course": "Econometría Básica"
          },
          {
            "text": "Hace un muy buen manejo del tema y logra que sus estudiantes se atrapen en el tema, ya que su manera de enseñar es didáctica. Excelente profesor",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Econometría Básica"
          },
          {
            "text": "El docente tiene tanto buen manejo del tema, como dominio de los estudiantes. Sabe explicar muy bien, los parciales no son difíciles, complementa todos los temas con experiencias personales que te ayudan a comprender mas el tema en situaciones cotidianas.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Econometría Básica"
          },
          {
            "text": "Un curso bastante retador pero el profesor es demasiado bueno explicando cada uno de los temas y se preocupa mucho por que los estudiantes tengan un entendimiento claro",
            "rating": 5,
            "date": "2025-06-12",
            "course": "Econometría Básica"
          }
        ]
      }
    ]
  },
  {
    "name": "Econometría Intermedia",
    "prerequisite": "Econometría Básica",
    "difficulty": 3.33,
    "professors": [
      {
        "slug": "otero-j",
        "name": "Jesús Otero",
        "rating": 3.25,
        "reviews": [
          {
            "text": "Jesús explica muy rápido, y en principio, los contenidos del curso son densos. Sin embargo, Jesús es muy pragmatico a la hora de evaluar, por lo que en realidad solo hay que estudiar cosas prácticas. Es fácil dejar la materia alta, y el profesor es abierto a las dudas y a colaborar.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Econometría Intermedia"
          },
          {
            "text": "Daniela Rodríguez (la profe asistente) es genial, en general es un curso muy útil si te interesan temas de modelación para macro, los temas son muy cheveres pero necesita mucho estudio autonomo. La clase magistral deja mucho que desear.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Econometría Intermedia"
          },
          {
            "text": "El curso ahonda en serie de tiempo enfocándose en temas de Macroeconometría. Siendo honesto, puede ser una materia cuyas temas son bastante abstractos y difíciles de entender. Los teoremas y la matemática detrás de los modelos es compleja.  El profesor Jesús usa diapositivas y están demasiado cargadas de información por lo que puede ser difícil seguirle el ritmo. El proyecto empírico de la materia no es difícil mas hay que tener en cuenta los diferentes supuestos y pruebas para tener buena nota.  Afortunadamente él repite sus parciales pro lo que dar con uno anterior puede ser la diferencia entre parcharse y pasar alta la materia a preocuparse bastante.",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Econometría Intermedia"
          },
          {
            "text": "El curso tiene un montón de contenido y se podría decir que Jesus va a un ritmo un poco acelerado a veces. ain embargo, los parciales de Jesus son bastante aplicados, y no son difíciles, es muy muy importante ver parciales anteriores para entender que va a salir, pero no es grave para lo que podría ser por los contenidos.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Econometría Intermedia"
          }
        ]
      },  
     {
        "slug": "munoz-j",
        "name": "Jorge Enrique Múñoz",
        "rating": 5,
        "reviews": [
          {
            "text": "De los mejores profesores de la carrera",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Econometría Intermedia"
          },
          {
            "text": "Las clases son pesadas pero los parciales no son difíciles, suele preguntar lo mismo que explica en clase. ",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Econometría Intermedia"
          }
        ]
      }
    ]
  },
  {
    "name": "Economía Financiera",
    "prerequisite": "Microeconomía I, Probabilidad",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "castro-c",
        "name": "Carlos Castro",
        "rating": 2,
        "reviews": [
          {
            "text": "Sus clases eran muy aburridas con dinámicas poco llamativas y manejo del aula bastante malo. El material que propone no es muy útil y no permite tener conexión con las finanzas. Al menos esa fue mi experiencia. En lo personal no lo considero un buen profesor. El primer parcial es en E-Aulas. Sé que su final es una reseña.",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Economía Financiera"
          },
          {
            "text": "En este curso se ve la teoría de las finanzas, el profesor Carlos Castro entrega muchos recursos para la clase y el aprendizaje de la misma, lo que resulta bastante útil. Sin embargo, las clases tienden a ser monótonas.",
            "rating": 3.5,
            "date": "2025-06-20",
            "course": "Economía Financiera"
          }
        ]
      },
      {
        "slug": "serrano-r",
        "name": "Rafael Serrano",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Su clase es muy amena, bien estructurada y conecta bastante bien con el curso. Explica bastante bien tratando de aterrizar los temas a la vida real. Rafael es excelente profesor y ser humano. Sus parciales son en computador y no son difíciles. Son bastante parecidos a los problem sets. Al final si llevas el acumulado igual o por encima de 4.5 te exime del parcial final.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Economía Financiera"
          }
        ]
      }
    ]
  },

  {
    "name": "Economía Matemática",
    "prerequisite": "Cálculo II, Álgebra Lineal, Lógica y Matemáticas Discretas",
    "difficulty": 4.35,
    "professors": [
      {
        "slug": "kayi-c",
        "name": "Cagatay Kayi",
        "rating": 4.4,
        "reviews": [
          {
            "text": "Muy buen profesor,  maneja excelente los temas y sabe que su materia ya es suficientemente difícil, por lo que hace que la dinámica al momento del parcial y cuando explica los temas sea más fácil y lograble ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Economía Matemática"
          }, 
         {
            "text": "La materia puede llegar a ser bastante complicada, pero realmente es cuestión de estudiarla bien y sobre todo tener buenas bases. Son muchas fórmulas y muchos temas, hay que estudiar bastante y los parciales no son sencillos. Eso si, el profesor ayuda mucho con las notas si uno muestra esfuerzo y buena actitud.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Economía Matemática"
          },
         {
            "text": "Cagatay es lo que salva el curso y ayuda a que las personas no pierdan la materia. Él sabe que la materia es muy complicada y ayuda mucho. Apoya mucho el proceso de aprendizaje de los estudiantes y con los parciales.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Economía Matemática"
          },
          {
            "text": "La materia es complicada, son muchos conceptos y definiciones que uno se tiene que aprender. Pero el profesor es súper amable y explica bien, además es súper suave con las notas si uno va a clase. Recomiendo mucho ir a las monitorias y toca empezar a estudiar con tiempo para los parciales.",
            "rating": 4,
            "date": "2025-06-20",
            "course": "Economía Matemática"
          },
          {
            "text": "Aunque la clase sea en inglés el profesor a veces responde cosas en español y es muy bueno resolviendo dudas de los estudiantes... A veces es un poco desorganizado en el desarrollo de unos ejercicios entonces hay que ponerle mucha atención a clase...a materia como tal tiene muchos componentes pesados y algunos que personalmente por que observará no los entendía. El monitor esclarecio y resumió todos los conceptos muy bien (eso es muy importante) por último las calificaciones Cagatay las promedia y si en el siguiente corte te va mejor que el anterior, te sube el anterior (si en el primer corte te fue a medias, pero en el segundo te fue mejor el promedia pa nota para cambiar la nota del primer corte). Ecomat es fundamental para micro 3 por la intuición económica (más que todo convexidad y concavidad)",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Economía Matemática"
          }
        ]
      },
      {
        "slug": "ramirez-r",
        "name": "René Ramírez",
        "rating": 3.5,
        "reviews": [
          {
            "text": "Un curso abstracto que reúne lo viste en Logíca y Matemáticas Discretas, Cálculo I y Cálculo II para resolver problemas aplicados a la economía. La rigurosidad y el nivel de las demostraciones de este curso lo hacen tener una dificultad bastante alta.  En lo personal, me sirvió bastante tener buenas bases de Cálculo I para aprobar este curso sin dificultades. Claro, tuve que estudiar bastante.  René fue un excelente profesor explicando en detalle los temas, con mucha paciencia y sin problemas para devolverse o volver a explicar. ",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Economía Matemática"
          },
          {
            "text": "El curso da muchos conocimientos necesarios, y si bien es complicado, con estudio se puede dominar. René explicaba bien, pero podía ser injusto con notas y actividades, y en palabras informales, \"le dolia poner un 5\".Su actitud a veces también podía pasar por petulante.",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Economía Matemática"
          },
          {
            "text": "Rene es muy bueno explicando, como es bastante contenido toca concentrarse mucho pero si necesitas ayuda, lo puedes contactar o correo o acercarte que el siempre está disponible para sus alumnos.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Economía Matemática"
          }
        ]
      }
    ]
  },
{
    "name": "Escritura Académica para Finanzas y Economía",
    "prerequisite": "Lectura Crítica para Economía y Finanzas",
    "difficulty": 2,
    "professors": [
    {
        "slug": "montoya-d",
        "name": "Ruben Montoya",
        "rating": 5,
        "reviews": [
           {  
            "text": "Tiene muy buen dominio del tema, sabe explicar temas tan sencillos pero tan complejos a la vez que se relacionan con las formas e escribir. Te da siempre la retroalimentación sobre cada trabajo que entregamos. Es muy buena genta y super comprensivo. Nunca lo vas a ver de mal humor, y siento que eso influye en el desarrollo de la clase.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Escritura Académica para Finanzas y Economía"
          }
       ]
    },
 {
        "slug": "parra-t",
        "name": "Tirso Parra",
        "rating": 4,
        "reviews": [
           {  
            "text": "Tirso es muy amable, aunque toca sistir a las classes y en cierto modo hacer las lecturas para incorporarlas en los escritos de los parciales. Me bajó un poco la nota porque no le metí las lecturas a mi último texto pero igual es sencillo, sigue siendo relleno jaja",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Escritura Académica para Finanzas y Economía"
          }
       ]
    }
  ]
},

  {
    "name": "Estadística",
    "prerequisite": "Probabilidad, Álgebra Lineal",
    "difficulty": 3.64,
    "professors": [
      {
        "slug": "moreno-d",
        "name": "Diana Moreno",
        "rating": 2.7,
        "reviews": [
          {
            "text": "Es buena profesora, explica los conceptos de manera clara y es paciente con las dudas. En lo personal me parece más fácil que probabilidad, pero igual tiene su ciencia. No es una materia fácil pero tampoco una muy complicada.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Estadística"
          },
          {
            "text": "La clase es demasiado útil y se aprende bastante bien el software estadístico de RStudio. Manejarlo con facilidad es clave para aprobar el curso. El proyecto a realizar es sencillo y hay muchos temas que se pueden aplicar.  Diana explica bien y deja sus tableros en el aula virtual por lo que al estudiar puede ser de utilidad contar con ellos. Sin embargo, es muy pasivo agresiva, es muy cansona con las asistencias y tiene tratos diferentes con los estudiantes. Los dos primeros parciales son los mismos para los dos grupos, pero el final no y Diana suele tirar bastante fuerte ahí. ",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Estadística"
          },
          {
            "text": "El curso es fundamental para la economía, y si bien se elaboran todos los contenidos necesarios, la profesora Diana no está a la altura. Sus explicaciones no son particularmente buenas, muestra unos favoritismos por estudiantes muy explícitos, y sus metodologías son deficientes.",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Estadística"
          },
          {
            "text": "La materia no es difícil si se le pone empeño, la profe también es bien si le pones cuidado y le vas a clase, recomiendo estudiar mucho en el final ya que a veces nos confiamos porque no necesitamos nota.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Estadística"
          },
          {
            "text": "Diana es buena explicando y deja todo el material que se usa en la clade, es solo que estadística no es fácil y parece que fuera demasiado tema",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Estadística"
          }
        ]
      },
      {
        "slug": "reyes-c",
        "name": "César Reyes",
        "rating": 4.83,
        "reviews": [
          {
            "text": "Cesar es un excelente profesional! Siempre dispuesto a escuchar y extremadamente respetuoso. No es el tipo de profesor que \"regala\"  nota, si perdió, perdió ",
            "rating": 5,
            "date": "2025-06-23",
            "course": "Estadística"
          },
          {
            "text": "El César de estadística es más relajado que el César de probabilidad, explica muy bien los temas del curso y no tiene problema con volver a explicar temas vistos previamente. Muy recomendado.",
            "rating": 4.5,
            "date": "2025-06-23",
            "course": "Estadística"
          },
          {
            "text": "Es un gran preámbulo para econometría básica y sienta las bases para el resto de la carrera en Economía. El profesor es muy bueno y poseen mucho conocimiento en la materia, muy recomendado.",
            "rating": 5,
            "date": "2025-06-23",
            "course": "Estadística"
          }
        ]
      }
    ]
  },
  {
    "name": "Ética",
    "prerequisite": "N/A",
    "difficulty": 1.25,
    "professors": [
      {
        "slug": "montoya-r",
        "name": "Ruben Dario Montoya",
        "rating": 5,
        "reviews": [
           {
            "text": "Una materia muy fácil y el profesor la hace muy animada. Es asistir a clase y hacer las actividades asignadas y ya.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Ética"
          }       
        ]
      },
      {
        "slug": "moreno-m",
        "name": "Martha Moreno",
        "rating": 5,
        "reviews": [
           {
            "text": "Normal, la profesora es agradable pero no mucho fuera de eso",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Ética"
          }          
        ]
      },
      {
        "slug": "rey-s",
        "name": "Sebastián Rey",
        "rating": 5,
        "reviews": [
          {
            "text": "No es mal profesor pero es muy incumplido con las notas",
            "rating": 2.5,
            "date": "2025-06-09",
            "course": "Ética"
          },
          {
            "text": "La clase era bastante aburrida, no aportaba nada realmente. Algunas clases hacía quiz por lo que era mejor ir en vez de tener un 0,0. No recomiendo su clase ni muchos menos a Sebastián como profesor.",
            "rating": 1,
            "date": "2025-06-10",
            "course": "Ética"
          }        
        ]
      }
    ]
  },
  {
    "name": "Evaluación de Impacto",
    "prerequisite": "Econometría Básica",
    "difficulty": 3.5,
    "professors": [
      {
        "slug": "cortes-d",
        "name": "Darwin Cortés",
        "rating": 3,
        "reviews": [
          {
            "text": "Aplicación de lo visto en Econometría Básica. La clase es interesante quizás un poco abstracta, pero nada del otro mundo. El proyecto es útil para aprender y poner a prueba lo visto. ",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Evaluación de Impacto"
          },
          {
            "text": "Es una materia muy buena, especialmente para el enfoque de política pública.  Tiene un componente matemático y econométrico  amplio, así como teórico. Sirve mucho para uno tener diversas herramientas y reflexionar sobre cuáles usar al momento de evaluar el impacto de alguna politica.",
            "rating": 2.5,
            "date": "2025-06-10",
            "course": "Evaluación de Impacto"
          }
        ]
      } 
    ]
  },
  {
    "name": "Finanzas Corporativas",
    "prerequisite": "Planeación Financiera",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "rico-i",
        "name": "Iván Felipe Rico",
        "rating": 2.5,
        "reviews": [
           {
            "text": "El curso no aporta bastante dado que los temas abordados son vistos en contabilidad y matemáticas financieras. Para tener prerrequisitos Inversiones no vale la pena. Espero que al verse desde semestre más bajos pueda aportar más cosas. ",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Finanzas Corporativas"
          }, 
          {
            "text": "El profesor es bueno y sabe bastante, sin embargo la dinámica de la clase no es la mejor, es muy fácil perder el hilo. La materia resulta sencilla porque los parciales son fáciles, pero puede que no se aprenda mucho. Si o si hay que estudiar por cuenta propia para entender y aprender.",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Finanzas Corporativas"
          }        
        ]
      }
    ]
  },
  {
    "name": "Firmas y Comercio Internacional",
    "prerequisite": "N/A",
    "difficulty": 2.75,
    "professors": [
      {
        "slug": "talero-a",
        "name": "Andrea Talero",
        "rating": 4.75,
        "reviews": [
         {
            "text": "La docente tiene muy buen manejo del tema, te enseña a afrontar casos de la vida real con la relación a los temas explicados. Deja muchas actividades, pero no son difíciles y te ayudan a profundizar el tema. Fuera de todo lo anterior, de verdad es muy buena profesional.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Firmas y Comercio Internacional"
          },
         {
            "text": "Es una materia en la que se aprende mucho sobre consultoría, sobre cómo internacionalizar una empresa, etc. La profesora se enfoca en que se aprendan los temas pero también en que los estudiantes desarrollen habilidades blandas, lo cual me parece súper innovador, es una gran profesora que no solo te ayuda a tu desarrollo profesional sino también personal.",
            "rating": 4.5,
            "date": "2025-06-12",
            "course": "Firmas y Comercio Internacional"
          }
        ]
      }
    ]
  },

  {
    "name": "Haciendo Economía",
    "prerequisite": "N/A",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "rodriguez-p",
        "name": "Paul Rodríguez",
        "rating": 4.16,
        "reviews": [
          {
            "text": "Es un curso bastante sencillo, Paul es muy chévere y la clase es bastante aplicada. No hay que estudiar mucho, es fácil, pero hay muchas entregas, entonces si quita tiempo.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Haciendo Economía"
          },
          {
            "text": "La materia es muy sencilla, pero quita mucho tiempo con las entregas. Además, es un poco raro para los de analítica, porque ellos la ven en segundo, y normalmente la mete gente de economía de semestres mucho más avanzados, entonces el profesor asume que uno ya sabe mucho más de lo que en realidad sabe. A veces cuesta seguir los ejemplos por eso. Pero las actividades son fáciles. Paul también muy bueno, muy querido y sabe mucho, pero tiene ese problema.",
            "rating": 3.5,
            "date": "2025-06-10",
            "course": "Haciendo Economía"
          },
          {
            "text": "Paul es increíble profesor, muy paciente y querido al momento de orientar a los estudiantes en los trabajos. La materia requiere de muchas entregas seguidas y trabajo dentro de la clase por lo que puede ser bastante tedioso. El proyecto final es muy interesante permitiendo salir al campo y tomar datos a las personas directamente. Es una clase interesante, pero requiere de entregas muy seguidas por lo que, como a mí, se pueden olvidar y bajar la nota definitiva. ",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Haciendo Economía"
          }
        ]
      }
    ]
  },
{
    "name": "Historia Económica Colombiana",
    "prerequisite": "Introducción a la Ciencia Económica",
    "difficulty": 2.66,
    "professors": [
      {
        "slug": "henao-j",
        "name": "José Leonardo Henao",
        "rating": 5,
        "reviews": [
          {
            "text": "El profesor Henao es un excelente profesor, y es muy amable con los estudiantes",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Historia Económica Colombiana"
          },
          {
            "text": "El profesor José muestra una gran pasión por la enseñanza del curso, y realiza un recorrido por toda la historia económica del país, no solo la historia lejana, como pecan otros cursos. El temario de curso está muy bien hecho, y si bien la carga puede ser excesiva por momentos, la manera de evaluación es justa.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Historia Económica Colombiana"
          }
        ]
     },
     {
        "slug": "uribe-m",
        "name": "Mateo Uribe",
        "rating": 4.5,
        "reviews": [
          {
            "text": "El curso es interesante y hasta tranquilo, no creo que vuelva Mateo Uribe, pero es muy crack.",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Historia Económica Colombiana"
          }
       ]
     }
   ]
 },
{
    "name": "Historia Económica General",
    "prerequisite": "N/A",
    "difficulty": 3,
    "professors": [
      {
        "slug": "sanchez-r",
        "name": "Ramiro Sánchez",
        "rating": 1.63,
        "reviews": [
          {
            "text": "Tiene una carga de lecturas demasiado alta para la intensidad horaria de la clase. Las evaluaciones no son muy difíciles, pero requieren de su tiempo para prepararlas. No vale mucho la pena hacer todas las lecturas, pero sin duda estas son MUY buenas. El primer parcial siempre es el mismo. ",
            "rating": 2.5,
            "date": "2025-06-09",
            "course": "Historia Económica General"
          },
          {
            "text": "La metodología de Ramiro es de hacer sermón de las lecturas de la clase. No creo que deba ser una clase de segundo semestre, y deberían verla un poco más tarde en el semestre. La clase no es super difícil pero tiene muchas lecturas que son pesadas.",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Historia Económica General"
          },   
          {
            "text": "Los temas del curso son poco interesantes, poco útiles para la formación profesional de los estudiantes, y, contrario al nombre del curso, no aborda toda historia económica en su conjunto, solo la pre revolución industrial. Ramiro es un profesor poco empático, con deficiente metodología, y una actitud petulante. A pesar de todo, no se debe retirar la materia antes de tiempo. Mucha de la actitud del profesor es solo por asustar. En la práctica, es factible pasar el curso con buena nota.",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Historia Económica General"
          },  
          {
            "text": "El curso intenta abarcar más de lo que da el semestre, sin embargo, Ramiro repite preguntas de parciales anteriores y con las lecturas hechas, no es tan dificil",
            "rating": 2,
            "date": "2025-06-10",
            "course": "Historia Económica General"
          }
       ]
     }
   ] 
 },
  {
    "name": "Introducción a la Ciencia Económica",
    "prerequisite": "N/A",
    "difficulty": 2,
    "professors": [
      {
        "slug": "ferraz-e",
        "name": "Eduardo Ferraz",
        "rating": 3.14,
        "reviews": [
          {
            "text": "Ferraz es muy malo de profesor, no explica para nada bien, siempre se enreda muchísimo con cosas demasiado sencillas y en general complica mucho todo, sobre todo los parciales, hace que un tema fácil se vuelva muy dificíl porque no se expresa bien y lo confunde mucho a uno. Se nota que sabe muchísimo pero en verdad no lo explica bien.",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "Clase introductoria muy sencilla, conceptos muy básicos e intuitivos para cualquier persona, no se necesita tener bases en nada. El profesor Eduardo es de los mejores economistas que tiene la facultad, tiene mucho conocimiento y creo que hace un esfuerzo grande por dárselo a los estudiantes de la forma más sencilla posible, pero a veces le cuesta expresarse, sobre todo por escrito.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "Buena clase introductora combinando matemáticas con intuición económica. Las clases con el profesor titular dejan mucho que decir, pero con la profesora asistente son otro nivel. ",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "El profe no explica bien. Pero un buen curso, las temáticas perfectas para empezar en el mundo de la economía ",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "ICE es un curso chévere, con conceptos básicos e intuitivos, pero que a veces se complican más de la cuenta con las explicaciones dadas.",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "La materia no es complicada, tiene sus cositas pero no es nada del otro mundo. Ferraz es de los mejores profesores que conozco para la materia. Ana María era la primera vez que era profesora asistente, y creo que se estaba adaptando entonces no fue la mejor experiencia. ",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          },
          {
            "text": "Buen curso, completo, la única dificultad era el manejo del idioma.",
            "rating": 4,
            "date": "2025-06-14",
            "course": "Introducción a la Ciencia Económica"
          }
        ]
      },
      {
        "slug": "ropero-s",
        "name": "Sergio Ropero",
        "rating": 4,
        "reviews": [
          {
            "text": "Es un profesor excelente, explica los conceptos de manera clara y tiene muy buenas diapositivas. La clase es muy fácil si uno pone atención y hace los talleres.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          }
        ]
      },
      {
        "slug": "roig-g",
        "name": "Guillem Roig",
        "rating": 3.5,
        "reviews": [
          {
            "text": "El curso pilar de toda la carrera. Está muy bien diseñado, y cubre todas las bases esenciales de la economía. El profesor Eduardo no se daba a entender a si mismo, el profesor Guillem explicaba a la perfección, y el entonces profesor Andrés Garcia (hoy decano) se daba a entender pero tenía poco ritmo. La profesora Maria Sofia hizo buen trabajo en complementar las explicaciones de la clase principal.",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Introducción a la Ciencia Económica"
          }
        ]
      }
    ]
  },
  {
    "name": "Lectura Crítica para Economía y Finanzas",
    "prerequisite": "N/A",
    "difficulty": 1.5,
    "professors": [
      {
        "slug": "rey-s",
        "name": "Sebastián Rey",
        "rating": 2.16,
        "reviews": [
          {
            "text": "La clase es aburrida, no vale la pena hacer ninguna lectura y el profesor es bastante cansón con las notas. No es difícil la materia, pero no vale la pena. ",
            "rating": 1,
            "date": "2025-06-09",
            "course": "Lectura Crítica para Economía y Finanzas"
          },
          {
            "text": "No me gusta la forma en que Rey maneja la clase, pero es fácil y solo se deben hacer las actividades y ya.",
            "rating": 2.5,
            "date": "2025-06-09",
            "course": "Lectura Crítica para Economía y Finanzas"
          },
          {
            "text": "No leí en mayor parte del semestre, pero a Rey le es importante que al menos alguien del grupo lo haga, es un poco estricto con la calificación de los textos",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Lectura Crítica para Economía y Finanzas"
          }
        ]
      }
    ]
  },
  {
    "name": "Lógica y Matemáticas Discretas",
    "prerequisite": "N/A",
    "difficulty": 4,
    "professors": [
      {
        "slug": "duque-s",
        "name": "Sergio Nicolás Duque",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Lógica es la materia más dura de primer semestre, aunque le han bajado bastante a la cantidad de temas y a la dificultad de los mismos. Igual, es complicado, son muchos conceptos nuevos y es difícil cogerle el tiro al inicio. Yo lo que recomiendo es leer y ver vídeos, más que hacer un montón de ejercicios. Es súper importante aprender a ver la estructura de las demostraciones. Recomiendo, por ejemplo, este canal de YouTube: The Math Sorcerer. Para aprender a demostrar es excelente y tiene vídeos de todos los temas que se ven. Sobre el profesor Sergio solo tengo cosas buenas para decir. Yo no vi esta materia con él, la vi con César Rodríguez, pero si vi Pensamiento Matemático con él y me pareció excelente. Es una persona graduada recientemente, por lo que es muy empático con el estudiante, entiende la situación en la que estás y hace todo lo posible para ayudarte. Explica muy bien, califica súper suave, es muy paciente y deja actividades muy sencillas para sacar el 15%. Lo malo es que tiene varios trabajos, entonces se enreda bastante a veces; llega tarde, se nota distraído, cosas así, pero igual lo recomiendo full. Yo digo esto: no se asusten, parece algo muy loco al inicio, pero en realidad es bastante sencillo y te ayuda a adquirir muchísima madurez matemática.",
            "rating": 4,
            "date": "2025-06-20",
            "course": "Lógica y Matemáticas Discretas"
          },
          {
            "text": "Me parece que el profesor explica de una manera que hace la materia muchísimo más sencilla. La recomiendo con este profesor 100%",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Lógica y Matemáticas Discretas"
          }
        ]
      },
      {
        "slug": "piza-j",
        "name": "Jessenia Piza",
        "rating": 0.5,
        "reviews": [
          {
            "text": "Es una materia que no es fácil de aprender, difícil de pasar porque no dejan más cosas para poder pasar como taller o actividades dinámicas, y los profesores tampoco son muy dinámicos.",
            "rating": 0.5,
            "date": "2025-06-10",
            "course": "Lógica y Matemáticas Discretas"
          }
        ]
      },
      {
        "slug": "cubides-e",
        "name": "Edwin Cubides",
        "rating": 1.5,
        "reviews": [
          {
            "text": "Es un curso desafiante porque exige desarrollar una manera de pensar nueva para un recién entrado al curso. Sin embargo, es un curso necesario para el resto de la carrera. El profesor Edwin desarrolla los contenidos del curso y es justo a la hora de calificar, pero sus metodologías son planas y tiene poca actitud a la hora de enseñar.",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Lógica y Matemáticas Discretas"
          }
        ]
      },
      {
        "slug": "martinez-j",
        "name": "Juan Carlos Martínez",
        "rating": 1.5,
        "reviews": [
          {
            "text": "La materia es bastante complicada y es un filtro para los estudiantes de primer semestre. Útil para aprender a pensar y acostumbrarse a la carga académica de las asignaturas de la facultad",
            "rating": 1.5,
            "date": "2025-06-24",
            "course": "Lógica y Matemáticas Discretas"
          }
        ]
      }
    ]
  },
  {
    "name": "Macroeconomía I",
    "prerequisite": "Cálculo I, Medición Económica, Microeconomía I",
    "difficulty": 2.87,
    "professors": [
      {
        "slug": "velasco-a",
        "name": "Andrés Velasco",
        "rating": 4,
        "reviews": [
          {
            "text": "Me encantó esta clase donde se empiezan a ver conceptos de economía más a profundidad, entender el papel de la política económica. Andrés Velasco es excelente profesor, bastante exigente, pero te deja muy bien preparado para clases posteriores. Combina bastante bien la matemática con la intuición económica. ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          },
          {
            "text": "Es un curso bastante útil, da muchas bases para la carrera por lo que es fundamental tener claros los conceptos. El profesor Andrés Velasco aplica mucho los conceptos a la vida real y para los parciales la monitoria es esencial.",
            "rating": 3,
            "date": "2025-06-20",
            "course": "Macroeconomía I"
          }
        ]
      },
      {
        "slug": "avila-o",
        "name": "Oscar Iván Ávila",
        "rating": 5,
        "reviews": [
          {
            "text": "Muy buen profesional, trabaja en el Banco de la República y es profesor de posgrado así que el curso es actualizado en cierto modo para ser teorías antiquísimas",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Macroeconomía I"
          },
          {
            "text": "Es de los mejores profes que he tenido en la carrera, puesto que es un profe muy completo. Por un lado, conoce muy bien los temas del curso y es totalmente pedagógico en la forma en la que dicta dichos temas. Asimismo, además de un excelente profe, es un gran ser humano que se preocupa por el aprendizaje de sus estudiantes y su progreso. Siempre estaba muy dispuesto y pendiente a nuestras inquietudes por diferentes medios. Si bien la materia es en inglés, él hace todo muy comprensible.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          },
          {
            "text": "Buen curso, buen profesor ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          },
          {
            "text": "El profe hace todo no solo para que entendamos sino para que nos vaya muy bien en el curso.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          },
          {
            "text": "Oscar hace la materia muy fácil y explica muy bien las temáticas de las mismas. Ayuda con actividades extra para la notas y tiene una buena metodología.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          }
        ]
      },
      {
        "slug": "hernandez-r",
        "name": "Ramón Hernández",
        "rating": 5,
        "reviews": [
          {
            "text": "El mejor profesor que he tenido en toda la carrera, manejo de los temas de manera indescriptible, hace analogías de los temas a través de la historia y logra que de cualquier manera logres entender cada cosa, por más pequeña que sea. Solo me queda mucha gratitud hacia el y hacia esta materia que me respondieron a mi pregunta de  qué si esta carrera era la correcta para mí!",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          }
        ]
      }
    ]
  },
  {
    "name": "Macroeconomía II",
    "prerequisite": "Macroeconomía I, Microeconomía I",
    "difficulty": 3.64,
    "professors": [
      {
        "slug": "cepeda-f",
        "name": "Freddy Hernán Cepeda",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Es un gran curso para ampliar el conocimiento en macroeconomía, el profesor es de gran ayuda en términos de las evaluaciones y es necesario repasar los temas tanto con el monitor como individualmente.",
            "rating": 4.5,
            "date": "2025-06-23",
            "course": "Macroeconomía II"
          },
          {
            "text": "Es un curso que por su naturaleza tiende a ser complejo. El profesor explica los temas usando mucho las demostraciones matemáticas de los modelos, con la intención de explicar toda la intuición detrás de la fórmula final que se usa en los ejercicios. El uso de muchas matemáticas puede llevar a la confusión, sin embargo, la forma en que se explica hace que la mayoría de los temas queden claros. Es crucial el trabajo autónomo y asistir a las clases.",
            "rating": 5,
            "date": "2025-06-23",
            "course": "Macroeconomía II"
          }
        ]
      },
      {
        "slug": "zarate-j",
        "name": "Juan Pablo Zárate",
        "rating": 3.6,
        "reviews": [
          {
            "text": "El profesor estaba abierto a responder preguntas y programó sesiones con invitados muy buenos.",
            "rating": 4.5,
            "date": "2025-06-24",
            "course": "Macroeconomía II"
          },
          {
            "text": "Los temas son bastante complejos, es una clase micro fundamentada así que pueden hacerse a la idea. La experiencia con el profesor Juan Pablo fue muy regular: no explicaba bien, su manejo de la clase era pésimo a pesar de que es muy amable y es muy fácil pasar con él. ",
            "rating": 1.5,
            "date": "2025-06-24",
            "course": "Macroeconomía II"
          },
          {
            "text": "Es un curso que presenta muchos conceptos y modelos importantes de la macroeconomía moderna, pero carece de un foco académico claro. No hay un eje de ruta temático claro, simplemente unos temas agrupados y ya. El profesor Zarate desarrollaba los modelos completos pero explicaba poco la intuición detrás. Aún así, fue valiosa la experiencia de ver clase con alguien con su trayectoria, se interesaba en el rendimiento de los estudiantes, y traía invitados varios de la economía real.",
            "rating": 4,
            "date": "2025-06-24",
            "course": "Macroeconomía II"
          },
          {
            "text": "Zarate es muy padre, aunque a veces confunde las letras griegas y es un poco dificil entender su letra. Se preocupa porque los estudiantes entiendan así que no te quedes con las dudas que el es muy entregado a responder. Además están los invitados de la clase, por su experiencia conoce gente muy crack que lleva en algunas ocasiones a la u.",
            "rating": 4.5,
            "date": "2025-06-24",
            "course": "Macroeconomía II"
          }
        ]
      },
      {
        "slug": "hernandez-r",
        "name": "Ramón Hernández",
        "rating": 5,
        "reviews": [
          {
            "text": "Ramón es el mejor profesor que he tenido en pregrado. Sus herramientas didácticas hacían la clase muy dinámica",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía I"
          }
        ]
      }
    ]
  },
  {
    "name": "Macroeconomía III",
    "prerequisite": "Macroeconomía II, Economía Matemática",
    "difficulty": 3,
    "professors": [
      {
        "slug": "perez-r",
        "name": "Roberto Rafael Pérez",
        "rating": 4.75,
        "reviews": [
          {
            "text": "Mi experiencia fue increíble! Sobretodo desde el punto de vista de alguien que le gusta más la micro. El profesor es muy intuitivo, da todas las herramientas para obtener buenas notas y en las clases siempre tuvo la mejor actitud. Fácil de los cursos más disfrutables de la carrera",
            "rating": 5,
            "date": "2025-06-18",
            "course": "Macroeconomía III"
          },
          {
            "text": "Roberto es muy buen profesor, el curso no es tan complejo y hay bastante material para prepararse para el parcial, en gran parte el que entrega Roberto",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Macroeconomía III"
          },
          {
            "text": "Es una materia muy buena, dinámica y práctica. Este curso permite acoger  toda la teoría macro que uno ve antes, le suma otra, y todo se muestra y se analiza desde lo práctico, mirando siempre casos reales, tanto nacionales, internacionales como históricos. Uno se disfruta verdaderamente esta clase. ",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Macroeconomía III"
          },
          {
            "text": "Es un curso que introduce lo que es la macroeconomía moderna tal como se estudia y entiende hoy en día. Si bien se introducen todos los conceptos y modelos necesarios, sería bueno aumentar el rigor técnico del mismo. Esto en buena medida viene por el profesor Roberto, que enseña claramente la intuición pero no tanto el desarrollo de fondo. A su vez, el tiempo de clase se podría aprovechar mejor.",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Macroeconomía III"
          },
          {
            "text": "Profesor excelente! Para empezar la clase te la disfrutas como ninguna otra, el ambiente es genial y te sientes apasionado y curioso por cada tema, el profesor te da la confianza necesaria para que tú mismo creas en tus capacidades y no te rindas nunca. ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía III"
          },
          {
            "text": "La clase se basa en crecimiento económico. Tiene temas muy interesantes y aplica los conceptos vistos en las clases vistas de macroeconomía y economía matemática. Roberto es excelente profesor propiciando un ambiente muy agradable, se puede preguntar sin ningún problema y deja sacar absolutamente TODO en el parcial. Recomendado al 100%. ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Macroeconomía III"
          }
        ]
      }
    ]
  },
  {
    "name": "Matemáticas Financieras",
    "prerequisite": "Contabilidad Financiera",
    "difficulty": 3.25,
    "professors": [
      {
        "slug": "serrano-r",
        "name": "Rafael Serrano",
        "rating": 5,
        "reviews": [
           {
            "text": "El curso es bastante interesante y el profesor explica muy bien y es poco exigente.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Matemáticas Financieras"
           }  
        ]
      },
      {
        "slug": "rojas-e",
        "name": "Edgar Alonso Rojas",
        "rating": 3,
        "reviews": [
           {
            "text": " Muy importante esta clase para los financieros. Con el profesor Edgar era bastante fuerte la carga académica dentro del salón, sus parciales no eran precisamente sencillos, pero uno de verdad aprendía de matemáticas financieras en su clase. ",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Matemáticas Financieras"
           }  
        ]
      }
    ]
  },
  {
    "name": "Medición Económica",
    "prerequisite": "Introducción a la Ciencia Económica",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "ordonez-j",
        "name": "Juan Sebastián Ordoñez",
        "rating": 2,
        "reviews": [
          {
            "text": "El profe conoce muy bien los temas del curso, pero no tiene facultades de profesor. Es muy complejo entenderle, es muy desorganizado en sus explicaciones y no lleva las clases preparadas.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Medición Económica"
          }
        ]
      },
      {
        "slug": "mora-c",
        "name": "Carlos Mora",
        "rating": 2,
        "reviews": [
          {
            "text": "Muy buena persona, pero pierde demasiado tiempo con cosas que no son relevantes. La clase es demasiado teórica. Hay un desconecto grande entre lo que se enseña en la clase y lo que se evalua en los parciales. Podría ser una muy buena clase pero se desaprovecha bastante.",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Medición Económica"
          },
          {
            "text": "A pesar de ser bastante fácil, es la clase que menos he disfrutado en toda la carrera. Involucra mucha memorización, pues casi todo lo evaluable se centra en aprenderse fórmulas y saber cuándo usar cada una, pero en la clase no se profundiza para nada en de dónde vienen. En cambio, el profesor decide dedicar la mayoría del tiempo a obligar a los estudiantes a participar, hacer quices sorpresa, ejercicos que no tienen nada que ver con los parciales... entonces, uno depende bastante de la monitoría, pero en lo personal tampoco me pareció efectiva. Los talleres nada que ver con los parciales, en general muy poca explicación de lo que uno necesita saber para los parciales, tanto en la clase como en la monitoría. Y estos, en especial uno, parecía hecho con la intención de coger temas extremadamente sencillos sin ninguna ciencia y enredarlos lo más posible. En serio creo que la materia está muy mal dictada.",
            "rating": 1,
            "date": "2025-06-10",
            "course": "Medición Económica"
          },
          {
            "text": "Realmente los temas de la materia en sí son fáciles, pero tanto el profesor como el monitor se encargaron de hacer parciales extremadamente difíciles, los temas tampoco fueron explicados de la mejor manera en las clases, y que el monitor haga los parciales también se me hizo complicado dado que primero en los ejercicios prácticos, el monitor y el profesor tenían diferente manera de realizarlos y segundo no tenían en cuenta el tiempo que realmente se tenía para la realización del parcial, se hacían parciales demasiado largos y con alta complejidad para lo que realmente se requería en la materia. ",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Medición Económica"
          },
          {
            "text": "El profesor y el monitor tienen un muy buen manejo del tema, el profesor tiene micha experiencia lo que facilita la comprensión de los temas.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Medición Económica"
          },
          {
            "text": "Las clases teóricas son demasiado teóricas y las monitorias muy prácticas siendo el parcial demasiado práctico por lo que la monitoria terminaba siendo la clase.",
            "rating": 2.5,
            "date": "2025-06-09",
            "course": "Medición Económica"
          },
          {
            "text": "Es bastante aburrido. Mucha memorización. La clase no tiene absolutamente nada que ver con lo que se evalúa. El profesor es querido y paciente pero poco productivo, pierde mucho tiempo hablando de cosas irrelevantes y aburre bastante. Pero es fácil.",
            "rating": 1,
            "date": "2025-06-09",
            "course": "Medición Económica"
          },
          {
            "text": "Carlos es uno de los mejores profesores para esta materia. La materia depende mucho del monitor, ya que este es el que explica toda la parte práctica de los problemas.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Medición Económica"
          },
          {
            "text": "El problema del curso, es la metodología ya que en sí no es dificil pero es muy importante asistir a las monitorias y entender como se realizan los ejercicios de los parciales (a mano).",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Medición Económica"
          }
        ]
      }
    ]
  },
  { 
    "name": "Métodos Cuantitativos en Comercio",
    "prerequisite": "Teoría y Política del Comercio Internacional",
    "difficulty": 3,
    "professors": [
      {
        "slug": "silva-j",
        "name": "Juan Sebastián Silva",
        "rating": 2.75,
        "reviews": [
          {
            "text": "Si bien el docente tiene manejo del tema, y deja talleres que te ayudan a entender mucho mejor el manejo de bases de datos de comercio y todo el análisis que este conlleva, no me gusta su manera de explicar. Sin embargo, siempre esta dispuesto a solucionar todo tipo de dudas.",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Métodos Cuantitativos en Comercio"
          },
          {
            "text": "Es una materia muy interesante donde se puede aprender mucho sobre base de datos de comercio y cómo utilizarlas para sacar estadísticas  y tomar decisiones.El profesor tiene mucha experiencia sobre esto porque trabaja en el Banco de la República haciendo esto, sin embargo, tiende a ser un poco relajado y no es muy bueno explicando ",
            "rating": 2.5,
            "date": "2025-06-12",
            "course": "Métodos Cuantitativos en Comercio"
          }
        ]
      }
    ]
  },
  { 
    "name": "Métodos Cuantitativos en Finanzas",
    "prerequisite": "Econometría Básica, Inversiones",
    "difficulty": 3.75,
    "professors": [
      {
        "slug": "herrera-d",
        "name": "Daniel Arturo Herrera",
        "rating": 2.5,
        "reviews": [
          {
            "text": "Es un curso de alta complejidad, tanto en temas de la asignatura como en cantidad de estas mismas. Es necesario la monitoria de la clase, ya que los temas son densos o que el profesor realice algún tipo de talleres pre-parcial para la asimilación correcta de los temas. Debido a que el semestre pasado no sucedió nada de eso.",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Métodos Cuantitativos en Finanzas"
          },
          {
            "text": "La clase tiene conceptos bastante pesados siendo a veces muy abstractos. No tuvimos monitoria, pero este espacio puede ser vital. Con Daniel se tiene la ventaja que los parciales suelen ser iguales al semestre pasado. ",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Métodos Cuantitativos en Finanzas"
          }
        ]
      }
    ]
  },
  {
    "name": "Microeconomía I",
    "prerequisite": "Cálculo I, Introducción a la Ciencia Económica",
    "difficulty": 4.25,
    "professors": [
      {
        "slug": "sepulveda-c",
        "name": "Carlos Sepúlveda",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Excelente, enseña de manera clara y sencilla, ejemplos prácticos y explicaciones detalladas que ayudan demasiado a entender la intuición. Recomiendo mucho. Siento que la materia es igual de difícil con Sepúlveda o Luis H, pero uno entiende mucho más con Sepúlveda.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Muy buen profesor, enseña muy bien la intuición y hace muchos ejercicios para que uno pueda entender los conceptos. Es una materia dura que toca estudiar bastante. Recomiendo ir a todas las monitorías y practicar mucho.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Es un excelente profesional",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "La materia más importante de la carrera, por favor veánla con Sepúlveda y aprendan bien micro I. Van a usar estas bases para micro III, macro II, monetaria, ecomat y en general toda su carrera. Carlos es un profesor muy exigente pero es de los mejores que tuve en la carrera.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "El profesor conoce muy bien los contenidos de la materia, hace entretenida la clase, lo cual facilita y motiva mucho el aprendizaje, y se preocupa porque los estudiantes aprendan y sean críticos respecto a lo que aprenden. Adicional, el profe es un excelente ser humano que hace más amena la clase.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Es ridículo que hayan 2 parciales y cada uno valga el 35% de la materia. Eso no es un fomento al aprendizaje,el estudiante perfectamente aprende lo mismo si hay 3 parciales solo que con menos estrés.",
            "rating": 3,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "A pesar de ser un curso complicado, considero que el profesor es muy bueno y maneja muy bien los temas.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Tiene mala fama pero no es tan feo. Se puede pasar si se estudia, se tienen ciertas habilidades matemáticas y se utiliza el sentido común.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "A pesar de ser un curso difícil considero que el profesor explica muy bien, resuelve todas las dudas que uno tenga, de igual forma es muy importante el trabajo autónomo en esta materia.",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Microeconomía I"
          },
          {
            "text": "Es bueno, solo que al tener 2 parciales, estos son pesados.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Microeconomía I"
          },
          {
            "text": "El profesor explica de manera clara, sin embargo hay que estar atento a las clases ya que puede hacer preguntas.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Microeconomía I"
          }
        ]
      },
      {
        "slug": "gutierrez-l",
        "name": "Luis H Gutierrez",
        "rating": 2.5,
        "reviews": [
          {
            "text": "Mi experiencia con la materia es que el profesor Luis H tiende a desviarse de tema, no tiene espacios de solución de duda, es demasiado tema y tiende a ir muy rápido. Tips: la materia es muy auto didáctica, si te va bien con la lecturas recomiendan el libro de varian. Sin embargo, mi método: estudié con las diapositivas del profesor y desde el primer día que pude estudié realizando parciales, y sobre todo caerle bien al profesor.",
            "rating": 2,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "El curso es bastante útil para las materias siguientes y no es para nada fácil. Se requiere estudiar bastante, casi con tres semanas de antelación al parcial. Mi experiencia con Luis H fue muy buena, dándonos bastante espacios para hacer ejercicios, nos hacía clases extra de repaso y era fácil acceder a él vía correo. La monitoria puede ser la diferencia entre sufrir la materia o no.",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Este curso está dictado por un profesor que exige mucho, ofrece poco y dicta peor. Si tienen la oportunidad de verla con él, desaprovéchenla",
            "rating": 0.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Es bastante difícil. Muchas lecturas, mucho contenido y es bien pesada la parte matemática. Quita mucho tiempo.",
            "rating": 1.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Luis H es un profesor con una metodología muy especifica y puede no ser la adecuada para todo el mundo. Se tiende a dispersar un poco, pero se aprende bien. Además, recordarle que la materia la debe hacer en tablero (mucho mejor que con diapositivas). ",
            "rating": 3.5,
            "date": "2025-06-09",
            "course": "Microeconomía I"
          },
          {
            "text": "Es un curso muy interesante y relevante para mi carrera (finanzas). No estoy de acuerdo con la distribución de notas de la materia. Consideraría una buena idea dividir ambas teorías (consumidor y productor) en dos parciales cada una. De esta manera le resultaría a los estudiantes practicar y entender mejor cada teoría. Además de tener más oportunidades de aprobar la materia. ",
            "rating": 2,
            "date": "2025-06-10",
            "course": "Microeconomía I"
          }
        ]
      }
    ]
  },
  {
    "name": "Microeconomía II",
    "prerequisite": "Microeconomía I",
    "difficulty": 2.2,
    "professors": [
      {
        "slug": "gallego-j",
        "name": "Juan Miguel Gallego",
        "rating": 4.08,
        "reviews": [
          {
            "text": "La clase es muy interesante, la más chévere que he visto hasta ahora, y no da tan duro como Micro 1 si uno cogió buena intuición. Gallego excelente, clases muy interactivas, un montón de ejemplos prácticos, te enseña muy bien a ver los conceptos que enseña en la clase en la vida real.",
            "rating": 4,
            "date": "2025-06-20"
          },
          {
            "text": "Súper buena experiencia, el profesor sabe mucho sobre el tema y lo explica súper bien. A veces se desvía un poco del tema y empieza a hablar de otros temas pero igual súper recomendado.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Microeconomía II"
          },
          {
            "text": "Excelente clase",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Microeconomía II"
          },
          {
            "text": "Juan Miguel es buen profesor y su metodología y forma de explicar es muy buena. Sin embargo, con su nuevo cargo el horario de la clase se le complicó mucho y nos canceló muchas clases. Creo que eso desmotivó a varias personas. Sin embargo, el curso es fácil y sinceramente muy calmado.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Microeconomía II"
          },
          {
            "text": "Súper buena experiencia, el profesor sabe mucho sobre el tema y lo explica súper bien. A veces se desvía un poco del tema y empieza a hablar de otros temas pero igual súper recomendado.",
            "rating": 4,
            "date": "2025-06-20",
            "course": "Microeconomía II"
          }
        ]
      },
      {
        "slug": "lopez-n",
        "name": "Nazly López Peña",
        "rating": 5,
        "reviews": [
          {
            "text": "El curso es bastante sencillo y se puede aprobar sin problemas. El corte final puede ponerse feo, pero nada del otro mundo. Con Nazly tuve una muy buena experiencia, de las mejores profesores que he tenido.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía II"
          },
          {
            "text": "Excelente profesora, logra explicar de una manera indescriptible y hace que uno pueda entender a la perfección.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Microeconomía II"
          }
        ]
      }
    ]       
  },
  {
    "name": "Microeconomía III",
    "prerequisite": "Microeconomía I, Economía Matemática",
    "difficulty": 4.67,
    "professors": [
      {
        "slug": "cortes-d",
        "name": "Darwin Cortés",
        "rating": 3.8,
        "reviews": [
          {
            "text": "Es un curso que requiere mucho esfuerzo y dedicación, si bien no mucha gente lo pierde, sí puede pasar. En cuanto a Darwin mis comentarios son neutrales, sus clases tienden hacer aburridas pero cumple con su labor.",
            "rating": 3.5,
            "date": "2025-06-18",
            "course": "Microeconomía III"
          },
          {
            "text": "Darwin es muy buen profesor, pero es bastante escuelro así que asegurate de hacer las lecturas que les pida y copiar todo lo que haga en clase. Los contenidos son muy muy interesantes, aunque no quita que el curso en sí sea complejo",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Microeconomía III"
          },
          {
            "text": "El curso es muy completo, los cortes más complejos son los primeros dos.  Las bases matemáticas son fundamentales puesto que no se puede usar calculadora durante los parciales. Más que matemática es intuición... aún así la matemática es importante para la argumentación. Hagan ejercicios de parciales pasados, lean y entiendan que pasa con cada tema... la materia es para estudiar con tiempo (no el día anterior).",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Microeconomía III"
          },
          {
            "text": "Es un curso complicado pero muy bueno, se tienen que tener bases muy fuertes de cursos anteriores para entender mejor este curso. Igualmente, los tres componentes de esta clase son muy buenos, y permiten ver la microeconomía desde una perspectiva más real. En esta materia, básicamente, se aplican conceptos teóricos y matemáticos a ejemplos prácticos.",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Microeconomía III"
          },
          {
            "text": "Profesor excepcional! Logra que te atrapes en el tema a pesar de su complejidad y que te retes todos los días, que no te quedes con dudas, te incentiva a que preguntes, recuerda cosas que se le olvidan a los estudiantes como por ejemplo el polinomio de taylor que se ve en semestres anteriores y te hace sentir capaz de todo. Súper recomendado toda la vida ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Microeconomía III"
          },
          {
            "text": "La materia más difícil que vi en el pregrado. Los temas son demasiado interesantes y aplicables a la vida real. Sin embargo, es la matemática de estos que la vuelve complicada. La clase con Darwin es muy buena, pero bastante pesada. Da la clase completa sin descanso y llena demasiados tableros. Eso sí, sabe bastante y maneja muy bien los temas.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Microeconomía III"
          }
        ]
      }
    ]
  },
  {
    "name": "Precálculo",
    "prerequisite": "N/A",
    "difficulty": 1.78,
    "professors": [
      {
        "slug": "castro-d",
        "name": "Daniel Castro",
        "rating": 3.7,
        "reviews": [
          {
            "text": "La clase es muy sencilla. Los parciales son fáciles de preparar y en general no toca estudiar mucho.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Precálculo"
          },
          {
            "text": "Es un buen profesor, explica muy bien, realiza quices cada 15 días y los talleres no son obligatorios.",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Precálculo"
          },
          {
            "text": "El profe no da buen manejo a los temas, claro, se espera que un joven recien salido del colegio sepa los temas que se dictan pero no siemprw es asi por ende existe esta clase de precalculo donde se debe dar buenas explicaciones de los temas con ejercicios que qporten y saber organizar bien el tiempo,",
            "rating": 1,
            "date": "2025-06-09",
            "course": "Precálculo"
          },
          {
            "text": "El profesor es bueno, relajado pero bueno",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Precálculo"
          },
          {
            "text": "El curso no es tan complicado, el profesor es muy bueno en los temas y es bastante fácil pasar con é.",
            "rating": 4.5,
            "date": "2025-06-10",
            "course": "Precálculo"
          }
        ]
      },
      {
        "slug": "sierra-s",
        "name": "Stella Sierra",
        "rating": 3,
        "reviews": [
          {
            "text": "La profesora explica muy bien las bases, es muy útil para los que no aprendieron bien en el colegio.",
            "rating": 3,
            "date": "2025-06-19",
            "course": "Precálculo"
          }
        ]
      },
      {
        "slug": "soler-j",
        "name": "Jimena Soler",
        "rating": 3,
        "reviews": [
          {
            "text": "La profe Jimena es la mejor para empezar la línea de matemática, es muy querida y ayuda mucho a los estudiantes.",
            "rating": 3,
            "date": "2025-06-19",
            "course": "Precálculo"
          }
        ]
      },
      {
        "slug": "barriga-e",
        "name": "Eliana Barriga",
        "rating": 3,
        "reviews": [
          {
            "text": "Una introducción a las matemáticas que si no se toman buenos hábitos de estudio puede complicarse la asignatura, en especial si no se traen buenas bases matemáticas desde el colegio.",
            "rating": 3,
            "date": "2025-06-19",
            "course": "Precálculo"
          }
        ]
      }
    ]
  },
  {
    "name": "Probabilidad",
    "prerequisite": "Cálculo II",
    "difficulty": 3.8,
    "professors": [
      {
        "slug": "moreno-d",
        "name": "Diana Moreno",
        "rating": 3.25,
        "reviews": [
          {
            "text": "Es buena profesora, si hay dudas está siempre dispuesta a responderlas, pero tienen que caerle bien para que sea querida. Lo único es que va MUY rápido entonces la clase como tal puede llegar a ser confusa.",
            "rating": 2.5,
            "date": "2025-06-20",
            "course": "Probabilidad"
          },
          {
            "text": "Diana es exigente con la materia, pero te hace aprender todo lo necesario para la materia. La hace movida y los parciales no fueron muy difíciles.",
            "rating": 4,
            "date": "2025-06-09",
            "course": "Probabilidad"
          }
        ]
      },
      {
        "slug": "reyes-c",
        "name": "César Reyes",
        "rating": 3.75,
        "reviews": [
          {
            "text": "Cesar explica bien pero se enreda mucho y muchas veces parece ser mas complicado de lo que es, es buen profesor aunque hay cosas que podrían mejorar",
            "rating": 2.5,
            "date": "2025-06-10",
            "course": "Probabilidad"
          },
          {
            "text": "El curso es bastante útil para clases posteriores, en especial estadística y econometría. Al verla en intersemestral tuve parciales bastante complejos, pero el profesor César fue muy querido dándonos bastante espacio para preguntar ejercicios, solucionar dudas y practicar. Me gustó mucho su clase. No ponía problemas con las asistencias y era muy profesional. ",
            "rating": 5,
            "date": "2025-06-09",
            "course": "Probabilidad"
          }
        ]
      }
    ]
  },
  {
    "name": "Programación de Computadores",
    "prerequisite": "N/A",
    "difficulty": 3.66,
    "professors": [
      {
        "slug": "guerrero-j",
        "name": "José Alejandro Guerrero",
        "rating": 4.67,
        "reviews": [
          {
            "text": "Es un excelente profesor, pero quizás se ajusta mejor a cursos más avanazados. Tiene ese tipo de metodología, te trata como un amigo más que como un alumno, da mucha autonomía y en general es una clase muy autodidacta. Por ello es fácil no aprovecharla, no hacer nada en clase y pilotear los parciales con las diapositivas, pero no recomiendo hacer eso. Es muy tentador, pero no vale la pena, créanme. Es importante aprender las bases. La clase en si es muy fácil, una recocha total, pero tiene ese problema. Recomiendo tomarsela más en serio de lo que exige su dificultad.",
            "rating": 4,
            "date": "2025-06-20"
          },
          {
            "text": "La materia puede ser complicada, pero el profesor José Guerrero la hace muy agradable y mucho más manejable.",
            "rating": 5,
            "date": "2025-06-10"
          },
          {
            "text": "Pese a que en el momento de tomar el curso, no tenía casi conocimiento de programación, y así como yo habían mas personas, el docente supo entender esto y explicó de la manera más sencilla y súper entendible. Los parciales tenían dificultad, pero era acorde a lo que veíamos en clase. Su forma de calificar es chevere, y no es tan pesado.",
            "rating": 5,
            "date": "2025-06-09"
          }
        ]
      },
      {
        "slug": "davila-j",
        "name": "Juan Manuel Davila",
        "rating": 5,
        "reviews": [
          {
            "text": "El profesor va a lo que va, es muy bueno en temática y no es nada exigente calificante, en realidad es muy fácil pasar.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Programación de Computadores"
          }
        ]
      }
    ]   
  },
  {
    "name": "Renta Fija",
    "prerequisite": "Matemáticas Financieras",
    "difficulty": 3.5,
    "professors": [
      {
        "slug": "durango-s",
        "name": "Sebastián Durango",
        "rating": 1,
        "reviews": [
          {
            "text": "Durante el semestre, los temas vistos no eran claros, no eran explicados, de manera que aun sin tener bases en el tema, se lograra entender bien.",
            "rating": 2,
            "date": "2025-06-23",
            "course": "Renta Fija"
          },
          {
            "text": "Considero que la materia no es tan difícil, pero el profesor se complica mucho, no explica los temas de la mejor forma y se desvía mucho de la temática, lo que hace que uno como estudiantes se desconcentre y no aprenda lo suficiente.",
            "rating": 0.5,
            "date": "2025-06-10",
            "course": "Renta Fija"
          },
          {
            "text": "Terrible profesor, explica muy mal y no resuelve bien las dudas.",
            "rating": 0.5,
            "date": "2025-06-10",
            "course": "Renta Fija"
          },
          {
            "text": "Su clase no es dinámica, tiende a ser monótona y no aporta demasiado. Las evaluaciones no son precisamente sencillas y puede ser tediosa. Los amantes de las finanzas se la aguantan, pero quienes no, pasen de agache con esta materia.",
            "rating": 1,
            "date": "2025-06-25",
            "course": "Renta Fija"
          }
        ]
      }
    ]
  },
  {
    "name": "Renta Variable",
    "prerequisite": "Planeación Financiera",
    "difficulty": 2.5,
    "professors": [
      {
        "slug": "suarez-o",
        "name": "Omar Suárez",
        "rating": 4.5,
        "reviews": [
          {
            "text": "En lo personal esta clase no es de mi gusto y por eso la disfruté. Sin embargo, puede aportar conceptos muy importantes y ser atractiva para quien le guste estos temas. El profe suele hacer quices la mayoria de las clases por lo que puede ser tedioso, pero explica muy bien y es muy agradable. Espero les guiiste esta clase.",
            "rating": 4.5,
            "date": "2025-06-25",
            "course": "Renta Variable"
          }
        ]
      }
    ]
  },
  {
    "name": "Sistema Mundial del Comercio",
    "prerequisite": "N/A",
    "difficulty": 2.33,
    "professors": [
      {
        "slug": "martinez-m",
        "name": "Marcela Martínez",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Marcela fue excelente docente explicando los temas con bastante facilidad y aprender bastante sobre el comercio internacional. Sin embargo, podía dar demasiados temas dentro de una clase que era mucha información. De lo demás, es una muy buena experiencia con ella. ",
            "rating": 4.5,
            "date": "2025-06-09",
            "course": "Sistema Mundial del Comercio"
          },
          {
            "text": "La docente tiene muy buen manejo del tema, considero que toda la información que te da y si bien se puede salir del tema del momento, es igual relevante para la carrera, te enseña no sólo los temas teóricos si no diferentes maneras de conseguir información, demasiadas bases de datos y lecturas. Hace demasiadas actividades, una todas las clases, pero no son difíciles. Califica la asistencia.",
            "rating": 5,
            "date": "2025-06-10",
            "course": "Sistema Mundial del Comercio"
          },
          {
            "text": "Es una asignatura en la que se aprende mucho, de todo un poco sobre comercio. La profesora tiene mucha experiencia en estos temas y verdaderamente le apasionan, es muy estricta con la asistencia y saca nota todas las clases lo que hace un poco tediosa la clase.",
            "rating": 4,
            "date": "2025-06-12",
            "course": "Sistema Mundial del Comercio"
          }
        ]
      }
    ]
  },
  {
    "name": "Taller de Bloomberg",
    "prerequisite": "Matemáticas Financieras",
    "difficulty": 1,
    "professors": [
      {
        "slug": "andrade-a",
        "name": "Eduardo Andrade",
        "rating": 5,
        "reviews": [
          {
            "text": "Es una introducción al mundo de las finanzas, súper recomendado para que aprendan conocimientos generales de finanzas.",
            "rating": 5,
            "date": "2025-06-23",
            "course": "Taller de Bloomberg"
          }
        ]
      }
    ]
  },
  {
    "name": "Teoría y Política del Comercio Internacional",
    "prerequisite": "Microeconomía II",
    "difficulty": 3.5,
    "professors": [
      {
        "slug": "silva-j",
        "name": "Juan Sebastián Silva",
        "rating": 2.25,
        "reviews": [
          {
            "text": "La materia me gustó mucho, es full teoría, pero me encantó el tema. Sin embargo, la manera en como el docente explica no me gustó del todo, es un poco confuso. Las presentaciones que el docente presenta son súper completas. La manera de calificación es sencilla. Deja parciales como talleres. Se tiene que tener full dedicación para poder entenderle, o si no te pierdes.",
            "rating": 3,
            "date": "2025-06-10",
            "course": "Teoría y Política del Comercio Internacional"
          },
          {
            "text": "Es una clase muy teórica, abarca temas que ya se han visto en la carrera, pero también se aprenden temas nuevos. El profesor es poco dinámico en esta clase lo que hace que la clase se vuelva aburrida.",
            "rating":1.5,
            "date": "2025-06-12",
            "course": "Teoría y Política del Comercio Internacional"
          }
        ]
      }
    ]
  },
  {
    "name": "Teoría y Política Monetaria y Cambiaria",
    "prerequisite": "Macroeconomía I, Economía Matemática/Optimización para Finanzas",
    "difficulty": 4,
    "professors": [
      {
        "slug": "varrom-cj",
        "name": "Carlos Julio Varela y José Vicente Romero",
        "rating": 4.5,
        "reviews": [
          {
            "text": "Excelente curso si te interesan temas macro y financieros, lo recomiendo muchísimo para estudiantes de economía (debería ser obligatoria en economía).",
            "rating": 4,
            "date": "2025-06-10",
            "course": "Teoría y Política Monetaria y Cambiaria"
          }
        ]
      }
    ]
  }
]

